practice-for-ch-rails-music-app-long-practice-main/music_app/app/models/user.rb

    def generate_unique_session_token
        while true
            session_token = SecureRandom.urlsafe_base64
            return session_token unless User.exists?(session_token: session_token)
---
SELECT 1 AS one FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "[FILTERED]"], ["LIMIT", 1]]